---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures
source: html/3797ca4f-563c-ec8c-ff8b-258789a73766.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures

Failures about Electricity.

## Syntax (C#)
```csharp
public static class ElectricalFailures
```